:PROPERTIES:
:ID:       FF5F65FA-3A85-4931-9A45-78AE66A7C310
:END:
#+title: dashboard
#+filetags: :wip:emacs:

- [[id:799D307C-B31B-4CF7-A986-3E19786CF7CE][emacs]]起動時の初期起動時に表示するDashboard
- この画面にやりたいこと・みたいものを集約したい

* 何がみたい？
** TODOリスト
** 記事
- Zenn & Qiitaなどでバズってる記事
- Twitterで有名な人がつぶやいているもの(SNS)
- あとでみたいと思ってたやつ
  - スマホでもみたいやつがあると嬉しい
** 書きかけのノート
-> wipタグをつけるとか？

#+begin_src elisp
  (defun get-nodes-by-tag (tag)
    (org-roam-db-query [:select [
				 nodes:id
				 nodes:title
				 tags:tag
				 nodes:file]
				:from nodes
				:inner-join tags
				:on (= id node_id)
				:where (= tags:tag tag)
				]))
#+end_src

#+RESULTS:
: get-nodes-by-tag

#+begin_src elisp
  (get-nodes-by-tag "web")
#+end_src

#+RESULTS:
| 812EB16C-B9DC-42E7-A0C3-13C65DE2D2E0 | dired                                                                      | emacs           | /Users/shotaroaoki/zettelkasten/20240125224509-dired.org                                                                      |
| D44C5D46-80A0-4185-839F-1C2D200928B7 | elispの構成要素                                                            | elisp           | /Users/shotaroaoki/zettelkasten/20240222153612-elispの構成要素.org                                                            |
| 305EFD05-82D9-483D-892E-09D8CF6E0473 | elispの関数呼び出し                                                        | elisp           | /Users/shotaroaoki/zettelkasten/20240224170904-elispの関数呼び出し.org                                                        |
| 86A4F269-911F-46B6-908A-41893563946D | WebSocket                                                                  | web             | /Users/shotaroaoki/zettelkasten/20240424232551-websocket.org                                                                  |
| 8A046BFE-F7C7-4E5F-8427-15B4C2BBD3FE | Dart                                                                       | Dart            | /Users/shotaroaoki/zettelkasten/20240428003700-dart.org                                                                       |
| F2658354-621A-487C-95F9-8EB482E666AB | Flutterの制約                                                              | Flutter         | /Users/shotaroaoki/zettelkasten/20240217234345-flutterの制約.org                                                              |
| 4552B8BE-5078-4C04-A0E0-A63AE4A38FA7 | Sixpence None the Richer                                                   | music           | /Users/shotaroaoki/zettelkasten/20240325161425-sixpence_none_the_richer.org                                                   |
| C075B7E9-BA1F-4596-A918-20F13D5D323E | seq-concatenate                                                            | elisp           | /Users/shotaroaoki/zettelkasten/20240630005129-seq_concatenate.org                                                            |
| DBEE8727-29A7-4F51-A6D8-E9239E0CDAE3 | elispの関数呼び出し                                                        | elisp           | /Users/shotaroaoki/zettelkasten/20240224170918-elispの関数呼び出し.org                                                        |
| E31B2E7A-6376-41A4-BADE-9CF3A3966C64 | DIR property                                                               | org-mode        | /Users/shotaroaoki/zettelkasten/20240710224418-dir_property.org                                                               |
| DCDC6786-46D0-40F3-B895-92D358E8AFB7 | patchUrlMapping                                                            | Discord         | /Users/shotaroaoki/zettelkasten/20240422222544-patchurlmapping.org                                                            |
| 493739A6-5120-4579-B268-A37D3CF0D474 | RenderBox                                                                  | Flutter         | /Users/shotaroaoki/zettelkasten/20240218151438-renderbox.org                                                                  |
| 31FE3F94-DE6F-42AA-831A-C23564E464EF | Promise                                                                    | JavaScript      | /Users/shotaroaoki/zettelkasten/20240422224858-promise.org                                                                    |
| 95D0A141-FBE2-4A24-8B7B-BC5D89DA11D2 | Promise.all                                                                | JavaScript      | /Users/shotaroaoki/zettelkasten/20240422224858-promise.org                                                                    |
| 45C6278B-128A-4266-B328-7C04C677EAD9 | elisp                                                                      | emacs           | /Users/shotaroaoki/zettelkasten/20240501002440-elisp.org                                                                      |
| 45C6278B-128A-4266-B328-7C04C677EAD9 | elisp                                                                      | elisp           | /Users/shotaroaoki/zettelkasten/20240501002440-elisp.org                                                                      |
| C8229AB8-CBA8-4846-92DF-DC24456BAEB7 | aws.cognito.signin.user.adminって何?                                       | Cognito         | /Users/shotaroaoki/zettelkasten/20240128170107-aws_cognito_signin_user_adminって何.org                                        |
| C8229AB8-CBA8-4846-92DF-DC24456BAEB7 | aws.cognito.signin.user.adminって何?                                       | AWS             | /Users/shotaroaoki/zettelkasten/20240128170107-aws_cognito_signin_user_adminって何.org                                        |
| C9D65B80-4144-4BD0-8E8F-3BFDF2F75068 | org-roamのファイル群をGitでPullしてくる                                    | org-roam        | /Users/shotaroaoki/zettelkasten/20240520154706-org_roamのファイル群をgitでpullしてくる.org                                    |
| DB5F02DD-8B76-4CDC-98D8-D79385963585 | org-roam                                                                   | org-mode        | /Users/shotaroaoki/zettelkasten/20240125003342-org_roam.org                                                                   |
| DB5F02DD-8B76-4CDC-98D8-D79385963585 | org-roam                                                                   | emacs           | /Users/shotaroaoki/zettelkasten/20240125003342-org_roam.org                                                                   |
| DB5F02DD-8B76-4CDC-98D8-D79385963585 | org-roam                                                                   | org-roam        | /Users/shotaroaoki/zettelkasten/20240125003342-org_roam.org                                                                   |
| 384B8016-50F5-4F62-ACA9-F4E017CCF0A6 | Firebase Realtime Database                                                 | Firebase        | /Users/shotaroaoki/zettelkasten/20240414223445-firebase_realtime_database.org                                                 |
| 34751CE5-56AD-410F-94F9-657B9E60FF4D | Discord Activitiesのローカル動作確認方法                                   | Discord         | /Users/shotaroaoki/zettelkasten/20240414145903-discord_activitiesのローカル動作確認方法.org                                   |
| D6062B4D-B2FB-4DA9-9382-194C9D43FCB0 | 4AD                                                                        | label           | /Users/shotaroaoki/zettelkasten/20240905011848-4ad.org                                                                        |
| D6062B4D-B2FB-4DA9-9382-194C9D43FCB0 | 4AD                                                                        | music           | /Users/shotaroaoki/zettelkasten/20240905011848-4ad.org                                                                        |
| 81489362-A1D5-4DFD-B51A-940F65B723C4 | スペシャルフォーム                                                         | elisp           | /Users/shotaroaoki/zettelkasten/20240224171303-スペシャルフォーム.org                                                         |
| 24235807-6A72-4F24-B0AE-12BDA3DC006C | Requestオブジェクト                                                        | JavaScript      | /Users/shotaroaoki/zettelkasten/20240422224527-requestオブジェクト.org                                                        |
| EB3BE4F5-7CE7-4E43-9EAC-975494BA9F84 | This Mortal Coil                                                           | 聴く            | /Users/shotaroaoki/zettelkasten/20240905011710-this_mortal_coil.org                                                           |
| EB3BE4F5-7CE7-4E43-9EAC-975494BA9F84 | This Mortal Coil                                                           | artist          | /Users/shotaroaoki/zettelkasten/20240905011710-this_mortal_coil.org                                                           |
| EB3BE4F5-7CE7-4E43-9EAC-975494BA9F84 | This Mortal Coil                                                           | music           | /Users/shotaroaoki/zettelkasten/20240905011710-this_mortal_coil.org                                                           |
| 4484837B-AD43-481C-87C2-BC42E9944BFE | 実践Next.js                                                                | nextjs          | /Users/shotaroaoki/zettelkasten/20240430162931-実践next_js.org                                                                |
| 4484837B-AD43-481C-87C2-BC42E9944BFE | 実践Next.js                                                                | book            | /Users/shotaroaoki/zettelkasten/20240430162931-実践next_js.org                                                                |
| 4484837B-AD43-481C-87C2-BC42E9944BFE | 実践Next.js                                                                | frontend        | /Users/shotaroaoki/zettelkasten/20240430162931-実践next_js.org                                                                |
| 4484837B-AD43-481C-87C2-BC42E9944BFE | 実践Next.js                                                                | web             | /Users/shotaroaoki/zettelkasten/20240430162931-実践next_js.org                                                                |
| 88C8DBC2-BE2A-4A37-B963-AD5CAE2600DC | ソフトナビゲーション                                                       | nextjs          | /Users/shotaroaoki/zettelkasten/20240430162931-実践next_js.org                                                                |
| 88C8DBC2-BE2A-4A37-B963-AD5CAE2600DC | ソフトナビゲーション                                                       | book            | /Users/shotaroaoki/zettelkasten/20240430162931-実践next_js.org                                                                |
| 88C8DBC2-BE2A-4A37-B963-AD5CAE2600DC | ソフトナビゲーション                                                       | frontend        | /Users/shotaroaoki/zettelkasten/20240430162931-実践next_js.org                                                                |
| 88C8DBC2-BE2A-4A37-B963-AD5CAE2600DC | ソフトナビゲーション                                                       | web             | /Users/shotaroaoki/zettelkasten/20240430162931-実践next_js.org                                                                |
| 2E0A0A05-9090-4B64-A501-79B5687F49E4 | 直接データを取得するServerComponent                                        | nextjs          | /Users/shotaroaoki/zettelkasten/20240430162931-実践next_js.org                                                                |
| 2E0A0A05-9090-4B64-A501-79B5687F49E4 | 直接データを取得するServerComponent                                        | book            | /Users/shotaroaoki/zettelkasten/20240430162931-実践next_js.org                                                                |
| 2E0A0A05-9090-4B64-A501-79B5687F49E4 | 直接データを取得するServerComponent                                        | frontend        | /Users/shotaroaoki/zettelkasten/20240430162931-実践next_js.org                                                                |
| 2E0A0A05-9090-4B64-A501-79B5687F49E4 | 直接データを取得するServerComponent                                        | web             | /Users/shotaroaoki/zettelkasten/20240430162931-実践next_js.org                                                                |
| D46B7F37-40B3-4301-AAF9-01EE69626E4D | Catch-all Segment                                                          | nextjs          | /Users/shotaroaoki/zettelkasten/20240430162931-実践next_js.org                                                                |
| D46B7F37-40B3-4301-AAF9-01EE69626E4D | Catch-all Segment                                                          | book            | /Users/shotaroaoki/zettelkasten/20240430162931-実践next_js.org                                                                |
| D46B7F37-40B3-4301-AAF9-01EE69626E4D | Catch-all Segment                                                          | frontend        | /Users/shotaroaoki/zettelkasten/20240430162931-実践next_js.org                                                                |
| D46B7F37-40B3-4301-AAF9-01EE69626E4D | Catch-all Segment                                                          | web             | /Users/shotaroaoki/zettelkasten/20240430162931-実践next_js.org                                                                |
| A7C95EF3-147D-4884-A7D6-1D1608C2182E | Optional Catch-all Segment                                                 | nextjs          | /Users/shotaroaoki/zettelkasten/20240430162931-実践next_js.org                                                                |
| A7C95EF3-147D-4884-A7D6-1D1608C2182E | Optional Catch-all Segment                                                 | book            | /Users/shotaroaoki/zettelkasten/20240430162931-実践next_js.org                                                                |
| A7C95EF3-147D-4884-A7D6-1D1608C2182E | Optional Catch-all Segment                                                 | frontend        | /Users/shotaroaoki/zettelkasten/20240430162931-実践next_js.org                                                                |
| A7C95EF3-147D-4884-A7D6-1D1608C2182E | Optional Catch-all Segment                                                 | web             | /Users/shotaroaoki/zettelkasten/20240430162931-実践next_js.org                                                                |
| F48AE891-BADD-4C04-9447-7A095A381DED | Route Groups                                                               | nextjs          | /Users/shotaroaoki/zettelkasten/20240430162931-実践next_js.org                                                                |
| F48AE891-BADD-4C04-9447-7A095A381DED | Route Groups                                                               | book            | /Users/shotaroaoki/zettelkasten/20240430162931-実践next_js.org                                                                |
| F48AE891-BADD-4C04-9447-7A095A381DED | Route Groups                                                               | frontend        | /Users/shotaroaoki/zettelkasten/20240430162931-実践next_js.org                                                                |
| F48AE891-BADD-4C04-9447-7A095A381DED | Route Groups                                                               | web             | /Users/shotaroaoki/zettelkasten/20240430162931-実践next_js.org                                                                |
| EF14DF29-D73D-42B0-9C33-1C398D7D2E21 | Parallel RouteとIntercepting Route                                         | nextjs          | /Users/shotaroaoki/zettelkasten/20240430162931-実践next_js.org                                                                |
| EF14DF29-D73D-42B0-9C33-1C398D7D2E21 | Parallel RouteとIntercepting Route                                         | book            | /Users/shotaroaoki/zettelkasten/20240430162931-実践next_js.org                                                                |
| EF14DF29-D73D-42B0-9C33-1C398D7D2E21 | Parallel RouteとIntercepting Route                                         | frontend        | /Users/shotaroaoki/zettelkasten/20240430162931-実践next_js.org                                                                |
| EF14DF29-D73D-42B0-9C33-1C398D7D2E21 | Parallel RouteとIntercepting Route                                         | web             | /Users/shotaroaoki/zettelkasten/20240430162931-実践next_js.org                                                                |
| 44D74EDE-5CC3-4C47-A43C-419E5AF452F5 | ethereal wave                                                              | genre(music)    | /Users/shotaroaoki/zettelkasten/20240905010419-ethereal_wave.org                                                              |
| 44D74EDE-5CC3-4C47-A43C-419E5AF452F5 | ethereal wave                                                              | music           | /Users/shotaroaoki/zettelkasten/20240905010419-ethereal_wave.org                                                              |
| 280384E8-ACF6-4CA8-A147-5AAFF4AE2DEA | Jest                                                                       | Test            | /Users/shotaroaoki/zettelkasten/20240428005331-jest.org                                                                       |
| 280384E8-ACF6-4CA8-A147-5AAFF4AE2DEA | Jest                                                                       | JavaScript      | /Users/shotaroaoki/zettelkasten/20240428005331-jest.org                                                                       |
| 98A422B8-617E-48F2-84D6-D7C330B2A44B | Riverpod                                                                   | Riverpod        | /Users/shotaroaoki/zettelkasten/20240420174550-riverpod.org                                                                   |
| 98A422B8-617E-48F2-84D6-D7C330B2A44B | Riverpod                                                                   | Flutter         | /Users/shotaroaoki/zettelkasten/20240420174550-riverpod.org                                                                   |
| BFDF5805-52A5-4D7F-88DF-EBC419690988 | 発生保証                                                                   | game            | /Users/shotaroaoki/zettelkasten/20240220014255-発生保証.org                                                                   |
| BFDF5805-52A5-4D7F-88DF-EBC419690988 | 発生保証                                                                   | 格ゲー          | /Users/shotaroaoki/zettelkasten/20240220014255-発生保証.org                                                                   |
| 3FC60205-F960-446B-8046-EA74C5741B99 | cocoapods                                                                  | ios             | /Users/shotaroaoki/zettelkasten/20240730111355-cocoapods.org                                                                  |
| E02A573A-0AD0-49F1-AB88-9935DB83F1B4 | quoteスペシャルフォーム                                                    | elisp           | /Users/shotaroaoki/zettelkasten/20240224171951-quoteスペシャルフォーム.org                                                    |
| A96A94BB-8C25-4A8D-A52D-A366987DB22E | sequences                                                                  | elisp           | /Users/shotaroaoki/zettelkasten/20240630005304-sequences.org                                                                  |
| A4625491-FB20-4D97-A0BB-EE07FA1FCF5A | プリミティブ型                                                             | TypeScript      | /Users/shotaroaoki/zettelkasten/20241116171259-プリミティブ型.org                                                             |
| 2EFF3650-38FC-4052-9209-ED3A47363886 | ユーティリティ型                                                           | TypeScript      | /Users/shotaroaoki/zettelkasten/20241116173853-ユーティリティ型.org                                                           |
| 7AC78B5D-36B3-4EF7-AA6B-7950FE9050F9 | Discord Activitiesでイントロクイズを作る                                   | mywork          | /Users/shotaroaoki/zettelkasten/20240414145634-discord_activitiesでイントロクイズを作る.org                                   |
| 7AC78B5D-36B3-4EF7-AA6B-7950FE9050F9 | Discord Activitiesでイントロクイズを作る                                   | Spotify         | /Users/shotaroaoki/zettelkasten/20240414145634-discord_activitiesでイントロクイズを作る.org                                   |
| 7AC78B5D-36B3-4EF7-AA6B-7950FE9050F9 | Discord Activitiesでイントロクイズを作る                                   | Discord         | /Users/shotaroaoki/zettelkasten/20240414145634-discord_activitiesでイントロクイズを作る.org                                   |
| D55F1AAC-759C-423D-9CA1-3FDD06C11C2F | Amplify                                                                    | AWS             | /Users/shotaroaoki/zettelkasten/20240127224523-amplify.org                                                                    |
| 4617E0BC-DF84-42B1-96D3-3B94B7AF9145 | TypeScript                                                                 | TypeScript      | /Users/shotaroaoki/zettelkasten/20240330145419-typescript.org                                                                 |
| 4617E0BC-DF84-42B1-96D3-3B94B7AF9145 | TypeScript                                                                 | JavaScript      | /Users/shotaroaoki/zettelkasten/20240330145419-typescript.org                                                                 |
| 26F2A73B-08A0-4181-940D-2B3CA5960BC6 | cond                                                                       | lisp            | /Users/shotaroaoki/zettelkasten/20240504015340-cond.org                                                                       |
| 71A58D04-253A-4118-90AD-584AF5AAC935 | hydra(emacs)                                                               | emacs           | /Users/shotaroaoki/zettelkasten/20240420172822-hydra_emacs.org                                                                |
| C9983E7F-8165-4CC2-80AD-8EC107A0DCEA | script要素                                                                 | html            | /Users/shotaroaoki/zettelkasten/20240420002606-script要素.org                                                                 |
| C9983E7F-8165-4CC2-80AD-8EC107A0DCEA | script要素                                                                 | web             | /Users/shotaroaoki/zettelkasten/20240420002606-script要素.org                                                                 |
| E5889D25-7616-4072-B6E0-7E759893F12B | Discord Activities                                                         | Discord         | /Users/shotaroaoki/zettelkasten/20240330134259-discord_activities.org                                                         |
| 00721C27-B1B6-43BC-A275-D8C99E3A2BCF | alchemist(flutter)                                                         | Flutter         | /Users/shotaroaoki/zettelkasten/20241002164114-alchemist_flutter.org                                                          |
| 52ED7897-D8CD-46AD-B041-BBB3797691C8 | サーバーレス開発のベストプラクティス                                       | AWS_SUMMIT_2024 | /Users/shotaroaoki/zettelkasten/20240621114709-サーバーレス開発のベストプラクティス.org                                       |
| 52ED7897-D8CD-46AD-B041-BBB3797691C8 | サーバーレス開発のベストプラクティス                                       | AWS             | /Users/shotaroaoki/zettelkasten/20240621114709-サーバーレス開発のベストプラクティス.org                                       |
| 081A2901-A30A-403E-B962-CE3859A2B187 | org-capture                                                                | org-mode        | /Users/shotaroaoki/zettelkasten/20240402182654-org_capture.org                                                                |
| 79A5613A-CC3E-4B11-B2DF-41E35CDF06F9 | init.el                                                                    | emacs           | /Users/shotaroaoki/zettelkasten/20240511020357-init_el.org                                                                    |
| 7F02F36E-8C2B-4E87-89BF-2E6A061787E2 | hydra(emacs)でorg-roamをつかいやすく                                       | emacs           | /Users/shotaroaoki/zettelkasten/20240511020357-init_el.org                                                                    |
| EB117E13-AD30-4B84-A939-771431D5B8EE | org-roamでtitleを変更したい                                                | org-roam        | /Users/shotaroaoki/zettelkasten/20240209142944-org_roamでtitleを変更したい.org                                                |
| F8FF0EFF-9193-4FF1-B3A5-5D66D1739054 | RiverpodのProvider                                                         | Riverpod        | /Users/shotaroaoki/zettelkasten/20240209153416-riverpodのprovider.org                                                         |
| F8FF0EFF-9193-4FF1-B3A5-5D66D1739054 | RiverpodのProvider                                                         | Flutter         | /Users/shotaroaoki/zettelkasten/20240209153416-riverpodのprovider.org                                                         |
| 6D5E9808-B9DE-4B7E-BFFB-60D116B87106 | tidalcyclesの音階(scale)                                                   | tidalcycles     | /Users/shotaroaoki/zettelkasten/20240316063205-tidalcyclesの音階_scale.org                                                    |
| BD17A1FE-7B33-4468-ACA0-6B69EF1C4E7E | org-roam-uiのコードブロックにシンタックスハイライトを実装する              | frontend        | /Users/shotaroaoki/zettelkasten/20240323023055-org_roam_uiのコードブロックにシンタックスハイライトを実装する.org              |
| BD17A1FE-7B33-4468-ACA0-6B69EF1C4E7E | org-roam-uiのコードブロックにシンタックスハイライトを実装する              | org-roam        | /Users/shotaroaoki/zettelkasten/20240323023055-org_roam_uiのコードブロックにシンタックスハイライトを実装する.org              |
| E9A7D2E2-F859-45D0-9499-2666769C07F1 | Webフロントエンドにおけるコロケーション                                    | frontend        | /Users/shotaroaoki/zettelkasten/20240709140140-colocatio.org                                                                  |
| 6691E529-585A-4856-B1AC-C24DCCB4C2E7 | JSX                                                                        | JavaScript      | /Users/shotaroaoki/zettelkasten/20240830005045-jsx.org                                                                        |
| 70E2620E-9D5A-493D-A8F3-0BCD49B2A064 | Shoegaze                                                                   | genre(music)    | /Users/shotaroaoki/zettelkasten/20240905012213-shoegaze.org                                                                   |
| 70E2620E-9D5A-493D-A8F3-0BCD49B2A064 | Shoegaze                                                                   | music           | /Users/shotaroaoki/zettelkasten/20240905012213-shoegaze.org                                                                   |
| F003B9E8-36C9-4ABB-83C6-0F0DF1A5A377 | outline                                                                    | org-mode        | /Users/shotaroaoki/zettelkasten/20240704222040-outline.org                                                                    |
| 08AE81C2-F8C8-4FDB-92DB-8BD1BBE0B792 | typeof                                                                     | TypeScript      | /Users/shotaroaoki/zettelkasten/20241116174514-typeof.org                                                                     |
| 08AE81C2-F8C8-4FDB-92DB-8BD1BBE0B792 | typeof                                                                     | JavaScript      | /Users/shotaroaoki/zettelkasten/20241116174514-typeof.org                                                                     |
| 9F6EC199-CEEF-44EF-9F57-C3057658E110 | typeof型演算子                                                             | TypeScript      | /Users/shotaroaoki/zettelkasten/20241116174514-typeof.org                                                                     |
| 9F6EC199-CEEF-44EF-9F57-C3057658E110 | typeof型演算子                                                             | JavaScript      | /Users/shotaroaoki/zettelkasten/20241116174514-typeof.org                                                                     |
| 4F0498B2-FC40-466F-A538-660680A98B53 | typeof演算子                                                               | TypeScript      | /Users/shotaroaoki/zettelkasten/20241116174514-typeof.org                                                                     |
| 4F0498B2-FC40-466F-A538-660680A98B53 | typeof演算子                                                               | JavaScript      | /Users/shotaroaoki/zettelkasten/20241116174514-typeof.org                                                                     |
| D9CB20AA-1DA4-49E0-9BCA-4A47E0AAB9D9 | puscher                                                                    | mobile          | /Users/shotaroaoki/zettelkasten/20240425005705-puscher.org                                                                    |
| D9CB20AA-1DA4-49E0-9BCA-4A47E0AAB9D9 | puscher                                                                    | web             | /Users/shotaroaoki/zettelkasten/20240425005705-puscher.org                                                                    |
| F5014C33-BF8E-4C61-B162-BCDD15841BBE | Amazon Q                                                                   | AWS             | /Users/shotaroaoki/zettelkasten/20240621140158-amazon_q.org                                                                   |
| 2BD24814-49CD-4736-8446-D44A83A7F88B | Amazon Q Developer                                                         | AWS             | /Users/shotaroaoki/zettelkasten/20240621140158-amazon_q.org                                                                   |
| 8D593871-DD31-4454-89D5-D658F1F0FA37 | コンスセル                                                                 | lisp            | /Users/shotaroaoki/zettelkasten/20240504021000-コンスセル.org                                                                 |
| ECB79BD7-377A-4BD5-9CC0-FBAFCCF76740 | 作りたいもの                                                               | mywork          | /Users/shotaroaoki/zettelkasten/20240420173849-作りたいもの.org                                                               |
| E8F40F53-137D-40E8-AAC7-12F79A4ED4C9 | org-roamで調べたいこと                                                     | org-roam        | /Users/shotaroaoki/zettelkasten/20240125004519-org_roamで調べたいこと.org                                                     |
| E8F40F53-137D-40E8-AAC7-12F79A4ED4C9 | org-roamで調べたいこと                                                     | emacs           | /Users/shotaroaoki/zettelkasten/20240125004519-org_roamで調べたいこと.org                                                     |
| 0173C121-7AF7-4502-A344-55787C266B07 | SPA                                                                        | web             | /Users/shotaroaoki/zettelkasten/20240430170135-spa.org                                                                        |
| C969F7FD-BB17-4D80-8134-00607A320111 | org-agenda                                                                 | org-mode        | /Users/shotaroaoki/zettelkasten/20240310163519-org_agenda.org                                                                 |
| C969F7FD-BB17-4D80-8134-00607A320111 | org-agenda                                                                 | org-roam        | /Users/shotaroaoki/zettelkasten/20240310163519-org_agenda.org                                                                 |
| C969F7FD-BB17-4D80-8134-00607A320111 | org-agenda                                                                 | emacs           | /Users/shotaroaoki/zettelkasten/20240310163519-org_agenda.org                                                                 |
| 5A0770D3-61A7-4618-9126-A3B88F1FF7F6 | ブラウザのデータストレージ                                                 | web             | /Users/shotaroaoki/zettelkasten/20241103194832-ブラウザのデータストレージ.org                                                 |
| 1833A312-977E-422B-8BC5-6A3E97975383 | SessionStorage                                                             | web             | /Users/shotaroaoki/zettelkasten/20241103194832-ブラウザのデータストレージ.org                                                 |
| CB3C1DD0-A1FC-4516-BAEB-00BDB48230DF | LocalStorage                                                               | web             | /Users/shotaroaoki/zettelkasten/20241103194832-ブラウザのデータストレージ.org                                                 |
| FC7AC8B2-18E3-40A7-B2B0-C481B79352B4 | Cookie                                                                     | web             | /Users/shotaroaoki/zettelkasten/20241103194832-ブラウザのデータストレージ.org                                                 |
| 3D12742E-FD6D-44F8-AC4E-491F33EB5F8D | SSR                                                                        | web             | /Users/shotaroaoki/zettelkasten/20240506042421-ssr.org                                                                        |
| 114CD45E-6D46-4A4D-91A0-EC15BE901653 | Amazon Correto                                                             | Java            | /Users/shotaroaoki/zettelkasten/20240515101934-amazon_correto.org                                                             |
| 59180C55-A204-4992-8AAA-65168A846A98 | emacs pinky                                                                | emacs           | /Users/shotaroaoki/zettelkasten/20240420173305-emacs_pinky.org                                                                |
| A7A9EB8A-4C82-4B49-BA74-7A6C5817650A | ワールドミュージック                                                       | music           | /Users/shotaroaoki/zettelkasten/20240315005524-ワールドミュージック.org                                                       |
| 848FDA07-7706-4D0E-9A31-6C71D0F579A2 | org-mode                                                                   | org-mode        | /Users/shotaroaoki/zettelkasten/20240310163806-org_mode.org                                                                   |
| 848FDA07-7706-4D0E-9A31-6C71D0F579A2 | org-mode                                                                   | emacs           | /Users/shotaroaoki/zettelkasten/20240310163806-org_mode.org                                                                   |
| 88846665-E3C9-491E-8A65-173A1C3F28D3 | Cocteau Twins                                                              | artist          | /Users/shotaroaoki/zettelkasten/20240905011344-cocteau_twins.org                                                              |
| 88846665-E3C9-491E-8A65-173A1C3F28D3 | Cocteau Twins                                                              | music           | /Users/shotaroaoki/zettelkasten/20240905011344-cocteau_twins.org                                                              |
| 5BB91630-A572-4A92-BC7F-432BE4E5525B | 音階(scale)                                                                | music           | /Users/shotaroaoki/zettelkasten/20240310195503-音階_scale.org                                                                 |
| D20667FA-BF8C-4CCB-BF43-A34C85AF1632 | URLオブジェクト                                                            | JavaScript      | /Users/shotaroaoki/zettelkasten/20240422224428-urlオブジェクト.org                                                            |
| 4066AB86-2395-4A96-AC7D-AB626B960B4E | ServerComponent                                                            | nextjs          | /Users/shotaroaoki/zettelkasten/20240506042334-servercomponent.org                                                            |
| C3C060D7-9C66-424E-9BE0-B7E31F1B1AA3 | CloudFormationでネストされたスタックのみUPDATE_ROLLBACK_FAILEDになっている | CloudFormation  | /Users/shotaroaoki/zettelkasten/20240909153447-cloudformationでネストされたスタックのみupdate_rollback_failedになっている.org |
| C3C060D7-9C66-424E-9BE0-B7E31F1B1AA3 | CloudFormationでネストされたスタックのみUPDATE_ROLLBACK_FAILEDになっている | AWS             | /Users/shotaroaoki/zettelkasten/20240909153447-cloudformationでネストされたスタックのみupdate_rollback_failedになっている.org |
| 70CA9663-CC6A-4061-A1B3-1F020B1D4942 | Stringifier(文字列化子)                                                    | JavaScript      | /Users/shotaroaoki/zettelkasten/20240422224235-stringifier_文字列化子.org                                                     |
| C7F02633-B90F-4FB9-BD8D-A8322D995E34 | DISTINCT                                                                   | sql             | /Users/shotaroaoki/zettelkasten/20240516101154-distinct.org                                                                   |
| A220B0A4-61CF-4E30-8CA0-20B88D133E83 | bedrock                                                                    | AWS             | /Users/shotaroaoki/zettelkasten/20240619193741-bedrock.org                                                                    |
| A70DD9BF-7723-453C-AB2B-E5BCB1764747 | Flutterの緩い制約と厳しい制約                                              | Flutter         | /Users/shotaroaoki/zettelkasten/20240218153855-flutterの緩い制約と厳しい制約.org                                              |
| 8B0ABF0E-1D24-4843-9469-47C48747D5ED | RSC                                                                        | React           | /Users/shotaroaoki/zettelkasten/20241001171101-rsc.org                                                                        |
| D4148D2A-67D7-4644-BCA1-4CB19125DDBB | ランドマーク要素                                                           | html            | /Users/shotaroaoki/zettelkasten/20240607145940-ランドマーク要素.org                                                           |
| 561BE9A0-F446-4406-9D6E-85C9C3DF8EE7 | React Suspense                                                             | React           | /Users/shotaroaoki/zettelkasten/20240702153204-react_suspense.org                                                             |
| 561BE9A0-F446-4406-9D6E-85C9C3DF8EE7 | React Suspense                                                             | frontend        | /Users/shotaroaoki/zettelkasten/20240702153204-react_suspense.org                                                             |
| C13533C6-9DFD-4A2B-A9AF-E7CD497F66FB | compo.social                                                               | mywork          | /Users/shotaroaoki/zettelkasten/20240709224249-compo_social.org                                                               |
| 48D91596-EF2D-4AEC-91D8-4731EDB69336 | org-babel                                                                  | org-mode        | /Users/shotaroaoki/zettelkasten/20240430172833-org_babel.org                                                                  |
| 9C080FE3-A508-4EA4-93DF-8D33984C5FD4 | org-babelでJSXをハイライトする                                             | org-mode        | /Users/shotaroaoki/zettelkasten/20240430172833-org_babel.org                                                                  |
| 677FAFF1-ACEA-44AE-B659-E97DC48E45E0 | emacsからファイルを削除したい                                              | emacs           | /Users/shotaroaoki/zettelkasten/20240125222655-emacsからファイルを削除したい.org                                              |
| 1EE1778A-5FE6-4B02-9D89-47F48B216CAD | Mapped Types                                                               | TypeScript      | /Users/shotaroaoki/zettelkasten/20241116165305-mapped_types.org                                                               |
| F64E1BB5-6DBD-4921-8166-455B20F11AC6 | Custom pipelines                                                           | Amplify         | /Users/shotaroaoki/zettelkasten/20240619194924-custom_pipelines.org                                                           |
| F64E1BB5-6DBD-4921-8166-455B20F11AC6 | Custom pipelines                                                           | AWS             | /Users/shotaroaoki/zettelkasten/20240619194924-custom_pipelines.org                                                           |
| 68F59879-D27C-4556-ACE2-F1E36F0EA892 | all-the-icons                                                              | emacs           | /Users/shotaroaoki/zettelkasten/20240430032852-all_the_icons.org                                                              |
| 147E9EBF-36C6-429C-BF25-C33D2E020D59 | Git                                                                        | Git             | /Users/shotaroaoki/zettelkasten/20240513094659-git.org                                                                        |
| 50EA3B03-F318-4EBB-90BB-00FDE6090B17 | magit                                                                      | emacs           | /Users/shotaroaoki/zettelkasten/20240205215743-magit.org                                                                      |
| E5AD78CC-CE44-4698-91E0-93EDF6A619D4 | Intercepting Route                                                         | nextjs          | /Users/shotaroaoki/zettelkasten/20240709140832-intercepting_route.org                                                         |
| B819418C-4E4D-4837-A0D5-942598EC348F | Parameterized Test                                                         | Test            | /Users/shotaroaoki/zettelkasten/20240428003918-parameterized_test.org                                                         |
| 4D5F7D97-089A-4C73-9925-68CA3AA36238 | Dream pop                                                                  | genre(music)    | /Users/shotaroaoki/zettelkasten/20240905012113-dream_pop.org                                                                  |
| 4D5F7D97-089A-4C73-9925-68CA3AA36238 | Dream pop                                                                  | music           | /Users/shotaroaoki/zettelkasten/20240905012113-dream_pop.org                                                                  |
| D0CD1F17-50B0-484A-840D-2D9E4F41A9D4 | org-babel実行時にコードブロックをハイライト                                | elisp           | /Users/shotaroaoki/zettelkasten/20240903225138-org_babel実行時にコードブロックをハイライト.org                                |
| AF960D11-5967-495C-B832-59EB1B1B105E | 発生フレーム                                                               | 格ゲー          | /Users/shotaroaoki/zettelkasten/20240217031657-発生フレーム.org                                                               |
| AF960D11-5967-495C-B832-59EB1B1B105E | 発生フレーム                                                               | game            | /Users/shotaroaoki/zettelkasten/20240217031657-発生フレーム.org                                                               |
| 9EB6B7D0-BC90-4B79-A38E-DF10AFAFDD47 | bondedState                                                                | ble             | /Users/shotaroaoki/zettelkasten/20240612152342-bondedstate.org                                                                |
| 9EB6B7D0-BC90-4B79-A38E-DF10AFAFDD47 | bondedState                                                                | android         | /Users/shotaroaoki/zettelkasten/20240612152342-bondedstate.org                                                                |
| 529502BE-9536-4339-A7AD-91BA86438899 | ClientComponent                                                            | nextjs          | /Users/shotaroaoki/zettelkasten/20240506045008-clientcomponent.org                                                            |
| A4BB9811-228F-4881-96BF-F19831EB70CA | ハイドレーション                                                           | nextjs          | /Users/shotaroaoki/zettelkasten/20240506045008-clientcomponent.org                                                            |
| D379EE24-8F29-4ACF-9907-1BA384671543 | history API                                                                | web             | /Users/shotaroaoki/zettelkasten/20240512201601-history_api.org                                                                |
| EF1E401F-229D-4A2B-9BA0-457A21624DFB | ivy                                                                        | emacs           | /Users/shotaroaoki/zettelkasten/20240310164419-ivy.org                                                                        |
| 0C407386-99D1-44B2-A096-F22B89B0C54E | S式                                                                        | elisp           | /Users/shotaroaoki/zettelkasten/20240222154132-s式.org                                                                        |
| 63A71BCD-C71F-4EAF-9A31-4BE7B7947CA0 | Discord                                                                    | Discord         | /Users/shotaroaoki/zettelkasten/20240330134629-discord.org                                                                    |
| C2F7CC12-44A0-45A4-84C3-2CB1D38242D4 | CSR                                                                        | web             | /Users/shotaroaoki/zettelkasten/20241001171535-csr.org                                                                        |
| 0C00237A-7489-41F1-A921-F2B0A1016009 | プロンプトチェーン                                                         | GenAI           | /Users/shotaroaoki/zettelkasten/20240621122702-プロンプトチェーン.org                                                         |
| E1CF7399-D63C-49A7-BE75-56F2D51704EF | JWT                                                                        | web             | /Users/shotaroaoki/zettelkasten/20241104144915-jwt.org                                                                        |
| 164B0598-6CA1-4072-ADB6-E83AA24DA2F2 | JOIN                                                                       | sql             | /Users/shotaroaoki/zettelkasten/20240629180250-join.org                                                                       |
| 9D30EC16-5595-409A-AA17-F77E89684985 | AppSync                                                                    | AWS             | /Users/shotaroaoki/zettelkasten/20240911101159-appsync.org                                                                    |
| 88A06F14-B3EC-4703-B367-CAA3E30F3729 | Union型                                                                    | TypeScript      | /Users/shotaroaoki/zettelkasten/20241116170034-union型.org                                                                    |
| 77B05E9C-AF19-4C2B-B8FE-A7AE9455E4FD | 判定可能なユニオン型(discriminated union)                                  | TypeScript      | /Users/shotaroaoki/zettelkasten/20241116170034-union型.org                                                                    |
| C5E12C18-E34D-47A9-B703-F5C82921D29E | あるぱちかぶと                                                             | artist          | /Users/shotaroaoki/zettelkasten/20240906010846-あるぱちかぶと.org                                                             |
| C5E12C18-E34D-47A9-B703-F5C82921D29E | あるぱちかぶと                                                             | music           | /Users/shotaroaoki/zettelkasten/20240906010846-あるぱちかぶと.org                                                             |
| 19BD53D7-D0FD-40DC-A3ED-381391287B95 | mocktailで type 'Null' is not a subtype of type 'XXX' エラー               | Flutter         | /Users/shotaroaoki/zettelkasten/20240809162539-mocktailで_type_null_is_not_a_subtype_of_type_xxx_エラー.org                   |
| 8FC47852-963C-4AC0-AD07-1B65DCA461B3 | org-syntax                                                                 | org-mode        | /Users/shotaroaoki/zettelkasten/20240810183956-org_syntax.org                                                                 |
| 47096488-6B07-44F6-9E5F-66587F585507 | org-roam-ui                                                                | org-roam        | /Users/shotaroaoki/zettelkasten/20240125003245-org_roam_ui.org                                                                |
| F01E0DFA-7BBF-4E96-B5F5-45E32CFA1972 | Discordで開発者モードを表示する                                            | Discord         | /Users/shotaroaoki/zettelkasten/20240419184049-discordで開発者モードを表示する.org                                            |
| BC2C2A9E-63CD-4559-A0BA-9DB239D9E867 | Labyrinth Ear                                                              | artist          | /Users/shotaroaoki/zettelkasten/20240905005505-labyrinth_ear.org                                                              |
| BC2C2A9E-63CD-4559-A0BA-9DB239D9E867 | Labyrinth Ear                                                              | music           | /Users/shotaroaoki/zettelkasten/20240905005505-labyrinth_ear.org                                                              |
| CD080ECE-173C-4319-8589-AED0727776CC | プログラミングTypeScript                                                   | JavaScript      | /Users/shotaroaoki/zettelkasten/20241107203900-プログラミングtypescript.org                                                   |
| CD080ECE-173C-4319-8589-AED0727776CC | プログラミングTypeScript                                                   | book            | /Users/shotaroaoki/zettelkasten/20241107203900-プログラミングtypescript.org                                                   |
| CD080ECE-173C-4319-8589-AED0727776CC | プログラミングTypeScript                                                   | TypeScript      | /Users/shotaroaoki/zettelkasten/20241107203900-プログラミングtypescript.org                                                   |
| 18AB4FBB-3EBE-4D81-A890-E097B8270574 | typechecker                                                                | JavaScript      | /Users/shotaroaoki/zettelkasten/20241107203900-プログラミングtypescript.org                                                   |
| 18AB4FBB-3EBE-4D81-A890-E097B8270574 | typechecker                                                                | book            | /Users/shotaroaoki/zettelkasten/20241107203900-プログラミングtypescript.org                                                   |
| 18AB4FBB-3EBE-4D81-A890-E097B8270574 | typechecker                                                                | TypeScript      | /Users/shotaroaoki/zettelkasten/20241107203900-プログラミングtypescript.org                                                   |
| E450A103-E578-40B4-A636-ECD2A36D2383 | 型システム(type system)                                                    | JavaScript      | /Users/shotaroaoki/zettelkasten/20241107203900-プログラミングtypescript.org                                                   |
| E450A103-E578-40B4-A636-ECD2A36D2383 | 型システム(type system)                                                    | book            | /Users/shotaroaoki/zettelkasten/20241107203900-プログラミングtypescript.org                                                   |
| E450A103-E578-40B4-A636-ECD2A36D2383 | 型システム(type system)                                                    | TypeScript      | /Users/shotaroaoki/zettelkasten/20241107203900-プログラミングtypescript.org                                                   |
| 4DB06FE9-1E2A-4A84-ACF8-95B5B786CD6C | tsconfig.json                                                              | JavaScript      | /Users/shotaroaoki/zettelkasten/20241107203900-プログラミングtypescript.org                                                   |
| 4DB06FE9-1E2A-4A84-ACF8-95B5B786CD6C | tsconfig.json                                                              | book            | /Users/shotaroaoki/zettelkasten/20241107203900-プログラミングtypescript.org                                                   |
| 4DB06FE9-1E2A-4A84-ACF8-95B5B786CD6C | tsconfig.json                                                              | TypeScript      | /Users/shotaroaoki/zettelkasten/20241107203900-プログラミングtypescript.org                                                   |
| 326CBD58-D58F-4BD5-87C8-DA70D877E3A7 | Zap to Char                                                                | emacs           | /Users/shotaroaoki/zettelkasten/20240414151927-zap_to_char.org                                                                |
| 48C966F2-BE28-43D9-86EE-BC27B2DD63FA | org-roamをpushするとき                                                     | org-roam        | /Users/shotaroaoki/zettelkasten/20240719010158-org_roamをpushするとき.org                                                     |
| AE463A5A-5D42-4A6C-A1CF-3365C66A0326 | org-cite                                                                   | org-mode        | /Users/shotaroaoki/zettelkasten/20240623144043-org_cite.org                                                                   |
| 1B2E2A9C-1CCE-426E-A3BB-A59E024E0CCF | Terraformのvariables                                                       | Terraform       | /Users/shotaroaoki/zettelkasten/20240415222447-terraformのvariables.org                                                       |
| D1FA9713-BD61-4A7E-ADCD-C55B0DA72022 | Google AnalyticsのeventをSQLで触る                                         | sql             | /Users/shotaroaoki/zettelkasten/20240513160336-bigqueryのrecord.org                                                           |
| 7339784D-88CA-4C6A-849A-744057EEBB5F | Parallel Route                                                             | nextjs          | /Users/shotaroaoki/zettelkasten/20240709140807-parallel_route.org                                                             |
| A5065A9F-6ECF-412B-A786-3D2EE81D6C0F | 安全飛び・詐欺飛び                                                         | 格ゲー          | /Users/shotaroaoki/zettelkasten/20240217031124-安全飛び_詐欺飛び.org                                                          |
| A5065A9F-6ECF-412B-A786-3D2EE81D6C0F | 安全飛び・詐欺飛び                                                         | game            | /Users/shotaroaoki/zettelkasten/20240217031124-安全飛び_詐欺飛び.org                                                          |
| 3EA66E4E-74B3-43F9-AD63-0B48667CA131 | org-roamの見出しにorg-idを振る                                             | org-roam        | /Users/shotaroaoki/zettelkasten/20240504035004-org_roamの見出しにorg_idを振る.org                                             |
| 156655CA-81A1-436E-A331-E5241650DD7C | org-id-get-create                                                          | org-roam        | /Users/shotaroaoki/zettelkasten/20240504035004-org_roamの見出しにorg_idを振る.org                                             |
| 358813A6-381C-49E8-AEA0-10C29FE8047F | Building Your First Activity in Discord                                    | JavaScript      | /Users/shotaroaoki/zettelkasten/20240330134529-building_your_first_activity_in_discord.org                                    |
| 358813A6-381C-49E8-AEA0-10C29FE8047F | Building Your First Activity in Discord                                    | Discord         | /Users/shotaroaoki/zettelkasten/20240330134529-building_your_first_activity_in_discord.org                                    |
| 92CA83DB-6830-4473-944B-F49B8AD1C31A | Flutter                                                                    | Flutter         | /Users/shotaroaoki/zettelkasten/20240325020908-flutter.org                                                                    |
| 34EDBB4E-F1A8-4D98-A808-78AA50F2B80E | elispのクオート                                                            | elisp           | /Users/shotaroaoki/zettelkasten/20240224171430-elispのクオート.org                                                            |
| 07F076CD-382D-41BC-A2D7-CC5CDDF9B33D | planning-poker                                                             | mywork          | /Users/shotaroaoki/zettelkasten/20240127224431-planning_poker.org                                                             |
| 4858E934-B1EC-4359-A73E-20F27AF8AEC5 | npx degit                                                                  | npm             | /Users/shotaroaoki/zettelkasten/20240222131856-npx_degit.org                                                                  |
| F4EA724E-5DD5-421D-A103-826C1A187829 | App Router                                                                 | Next.js         | /Users/shotaroaoki/zettelkasten/20240509000113-app_router.org                                                                 |
| 0F1B7CDE-2C75-4A2E-BC20-9F104AC45DB9 | windowオブジェクト                                                         | JavaScript      | /Users/shotaroaoki/zettelkasten/20240422223721-windowオブジェクト.org                                                         |
| 0F1B7CDE-2C75-4A2E-BC20-9F104AC45DB9 | windowオブジェクト                                                         | web             | /Users/shotaroaoki/zettelkasten/20240422223721-windowオブジェクト.org                                                         |
| 8D9726AD-9414-4BB2-B98E-98B76ACE3108 | TypeChallenge                                                              | TypeScript      | /Users/shotaroaoki/zettelkasten/20241116182508-typechallenge.org                                                              |
| 92EF5F70-8555-49C0-B661-BFDA8FADB989 | ロジカルシンキング                                                         | book            | /Users/shotaroaoki/zettelkasten/20241102155650-ロジカルシンキング.org                                                         |
| 6E3EF190-C383-47D3-A2AE-33706C4DFEEF | メッセージ                                                                 | book            | /Users/shotaroaoki/zettelkasten/20241102155650-ロジカルシンキング.org                                                         |
| 095571B5-2D22-4583-B494-63C55543A671 | 当初に設定した課題の答えではないことを伝えたいときは？                     | book            | /Users/shotaroaoki/zettelkasten/20241102155650-ロジカルシンキング.org                                                         |
| E3BBC11A-BB71-427E-BE82-9C785FB00B08 | 答えとしてのチェックリスト                                                 | book            | /Users/shotaroaoki/zettelkasten/20241102155650-ロジカルシンキング.org                                                         |
| 48B2A3D0-B653-4B2B-9C42-DD88584F3ACA | 米津玄師                                                                   | music           | /Users/shotaroaoki/zettelkasten/20240325163004-米津玄師.org                                                                   |
| A36ED2CD-8563-429D-B3B9-24165F4A0ADA | Conditional Types                                                          | TypeScript      | /Users/shotaroaoki/zettelkasten/20241116164449-conditional_types.org                                                          |
| 63204A08-2248-4C1F-A762-586D94501174 | healthのPRを作成したい                                                     | OSS             | /Users/shotaroaoki/zettelkasten/20240224163632-healthのprを作成したい.org                                                     |
| 63204A08-2248-4C1F-A762-586D94501174 | healthのPRを作成したい                                                     | Flutter         | /Users/shotaroaoki/zettelkasten/20240224163632-healthのprを作成したい.org                                                     |
| 1D353271-D6F8-46B5-B7D9-EE9F388D3A4E | Side Clipboard                                                             | mywork          | /Users/shotaroaoki/zettelkasten/20240811002228-side_clipboard.org                                                             |
| 1D353271-D6F8-46B5-B7D9-EE9F388D3A4E | Side Clipboard                                                             | vscode          | /Users/shotaroaoki/zettelkasten/20240811002228-side_clipboard.org                                                             |
| 393EBEE6-33BD-42BD-BABC-886FEFF77CC1 | Responseオブジェクト                                                       | JavaScript      | /Users/shotaroaoki/zettelkasten/20240422224936-responseオブジェクト.org                                                       |
| 40DC5010-C302-483F-A02C-B4CA6E83BAE0 | olp                                                                        | org-roam        | /Users/shotaroaoki/zettelkasten/20240402173543-olp.org                                                                        |
| 6F51BB0F-1D35-4ABE-9C3B-E42AB375F042 | elisp実行の仕組み                                                          | elisp           | /Users/shotaroaoki/zettelkasten/20240222154347-elisp実行の仕組み.org                                                          |
| 812A74D1-D7ED-46DE-AD3F-DC6DDE229099 | VRT                                                                        | frontend        | /Users/shotaroaoki/zettelkasten/20240420154832-vrt.org                                                                        |
| AEF7141A-E509-4A6C-A245-490511B97AAA | org-babelでtidalcyclesを実行したい                                         | org-mode        | /Users/shotaroaoki/zettelkasten/20240903214432-org_babelでtidalcyclesを実行したい.org                                         |
| AEF7141A-E509-4A6C-A245-490511B97AAA | org-babelでtidalcyclesを実行したい                                         | tidalcycles     | /Users/shotaroaoki/zettelkasten/20240903214432-org_babelでtidalcyclesを実行したい.org                                         |
| 61F9FDFE-FE65-4566-9C9F-21F1D36D4119 | sound texture of lyrics                                                    | book            | /Users/shotaroaoki/zettelkasten/20240310162132-sound_texture_of_lyrics.org                                                    |
| 61F9FDFE-FE65-4566-9C9F-21F1D36D4119 | sound texture of lyrics                                                    | music           | /Users/shotaroaoki/zettelkasten/20240310162132-sound_texture_of_lyrics.org                                                    |
| A710373E-0001-425F-82EB-594360D260B0 | org-insert-link                                                            | org-mode        | /Users/shotaroaoki/zettelkasten/20240710230040-org_insert_link.org                                                            |
| 5CF0090E-0459-4122-96A7-BD3DF14FF332 | org-tempo                                                                  | org-mode        | /Users/shotaroaoki/zettelkasten/20240511022655-org_tempo.org                                                                  |
| A947533A-4A3F-4E9A-8D48-512D67548CF0 | org-roamでファイルツリーを簡単に書きたい                                   | mywork          | /Users/shotaroaoki/zettelkasten/20240430172757-org_roamでファイルツリーを簡単に書きたい.org                                   |
| D11D60FD-6F50-42EA-9595-39D1F4DB607E | リテラル型                                                                 | TypeScript      | /Users/shotaroaoki/zettelkasten/20241116171221-リテラル型.org                                                                 |
| 7412F914-5D63-4EE0-B0B9-7D9B9E76E41E | web-a11y                                                                   | web             | /Users/shotaroaoki/zettelkasten/20240607140743-web_a11y.org                                                                   |
| 7412F914-5D63-4EE0-B0B9-7D9B9E76E41E | web-a11y                                                                   | frontend        | /Users/shotaroaoki/zettelkasten/20240607140743-web_a11y.org                                                                   |
| A6A7F3D5-61FD-41B8-8A81-FE7B5FFC0A33 | org-roamで新しいノードを作成したい                                         | org-roam        | /Users/shotaroaoki/zettelkasten/20240310163839-org_roamで新しいノードを作成したい.org                                         |
| 9D553693-77E8-499C-9EF3-390D9E1FC0FD | Flutterのプロジェクト作成方法                                              | Flutter         | /Users/shotaroaoki/zettelkasten/20240217160820-flutterのプロジェクト作成方法.org                                              |
| 999BD9C0-AA15-4D93-AC4C-2B2138476A2D | my-roam                                                                    | org-roam        | /Users/shotaroaoki/zettelkasten/20240425012215-my_roam.org                                                                    |
| B5C32B61-AD5C-4534-B7DA-63656E4B9890 | neve                                                                       | TypeScript      | /Users/shotaroaoki/zettelkasten/20241116175741-never.org                                                                      |
| 4F488C31-E1C5-4CB9-8BA5-D32A9BDE1F00 | プロンプトエンジニアリング入門                                             | GenAI           | /Users/shotaroaoki/zettelkasten/20240621114802-プロンプトエンジニアリング入門.org                                             |
| 4F488C31-E1C5-4CB9-8BA5-D32A9BDE1F00 | プロンプトエンジニアリング入門                                             | AWS_SUMMIT_2024 | /Users/shotaroaoki/zettelkasten/20240621114802-プロンプトエンジニアリング入門.org                                             |
| 4F488C31-E1C5-4CB9-8BA5-D32A9BDE1F00 | プロンプトエンジニアリング入門                                             | AWS             | /Users/shotaroaoki/zettelkasten/20240621114802-プロンプトエンジニアリング入門.org                                             |
| 65ED04F0-14DB-4623-B960-CB4A73E23242 | global-map(emacs)                                                          | emacs           | /Users/shotaroaoki/zettelkasten/20240430024247-global_map_emacs.org                                                           |
| 9F76DAF9-67F7-4BDE-8E90-22BCCFC9D826 | CloudFormationでAppSyncがNo resolver found                                 | AWS             | /Users/shotaroaoki/zettelkasten/20240911101139-cloudformationでappsyncがno_resolver_found.org                                 |
| 76955FCF-DD99-4EC0-8156-D4772E65F4A0 | org-roamの使い方                                                           | org-roam        | /Users/shotaroaoki/zettelkasten/20240125002541-org_roamの使い方.org                                                           |
| 0AF752DD-772F-43F6-AD69-E8993A62A211 | Embedded App SDK                                                           | Discord         | /Users/shotaroaoki/zettelkasten/20240330135354-embedded_app_sdk.org                                                           |
| D2AE4427-DD26-4F10-B601-026A3EFF3435 | tidalのchromatic                                                           | tidalcycles     | /Users/shotaroaoki/zettelkasten/20240310191035-tidalのchromatic.org                                                           |
| 8A5167D3-5D05-4A65-A497-3B5B420F4ADE | symbol型                                                                   | JavaScript      | /Users/shotaroaoki/zettelkasten/20241116172513-symbol型.org                                                                   |
| 19C371F3-78BD-4C1E-8BCF-92A82DAFDCCB | org-roam-node-findの一覧にtagを表示する                                    | org-roam        | /Users/shotaroaoki/zettelkasten/20240209145329-org_roam_node_findの一覧にtagを表示する.org                                    |
| 19C371F3-78BD-4C1E-8BCF-92A82DAFDCCB | org-roam-node-findの一覧にtagを表示する                                    | emacs           | /Users/shotaroaoki/zettelkasten/20240209145329-org_roam_node_findの一覧にtagを表示する.org                                    |
| 619DC21D-28FA-4D03-BE16-D2ADD59E060D | ミニバッファ                                                               | emacs           | /Users/shotaroaoki/zettelkasten/20240310164148-ミニバッファ.org                                                               |
| 52572AB8-7688-4B97-A1C3-50E71A5DC6E7 | TODO keyword                                                               | org-mode        | /Users/shotaroaoki/zettelkasten/20240704222617-todo_keyword.org                                                               |
| 42D07F9E-DD09-4A83-B854-22A658DA22D4 | The Non-Designer's Design Book                                             | book            | /Users/shotaroaoki/zettelkasten/20240225015408-the_non_designer_s_design_book.org                                             |
| 72FAD03E-5C0F-40DB-BD06-1B60AF0D63FC | BuildContext                                                               | Flutter         | /Users/shotaroaoki/zettelkasten/20241121163737-buildcontext.org                                                               |
| 95562EDE-EC82-4166-975C-13013D1661F1 | 42アルバム                                                                 | mywork          | /Users/shotaroaoki/zettelkasten/20240420174014-42アルバム.org                                                                 |
| 98BA0537-CE63-44E2-B4AC-1EFC711205EE | SvelteとSvelteKit                                                          | frontend        | /Users/shotaroaoki/zettelkasten/20240222133126-svelteとsveltekit.org                                                          |
| 98BA0537-CE63-44E2-B4AC-1EFC711205EE | SvelteとSvelteKit                                                          | SvelteKit       | /Users/shotaroaoki/zettelkasten/20240222133126-svelteとsveltekit.org                                                          |
| 98BA0537-CE63-44E2-B4AC-1EFC711205EE | SvelteとSvelteKit                                                          | Svelte          | /Users/shotaroaoki/zettelkasten/20240222133126-svelteとsveltekit.org                                                          |
| C7533D83-7605-4A64-9B2A-7A975DF9B43C | シンボル(elisp)                                                            | lisp            | /Users/shotaroaoki/zettelkasten/20240222155728-シンボル_elisp.org                                                             |
| C7533D83-7605-4A64-9B2A-7A975DF9B43C | シンボル(elisp)                                                            | elisp           | /Users/shotaroaoki/zettelkasten/20240222155728-シンボル_elisp.org                                                             |
| 799D307C-B31B-4CF7-A986-3E19786CF7CE | emacs                                                                      | emacs           | /Users/shotaroaoki/zettelkasten/20240125003409-emacs.org                                                                      |
| 3C8A1F78-09A0-4FD4-ABA9-D2C833D27CA4 | WITH                                                                       | sql             | /Users/shotaroaoki/zettelkasten/20240516104616-with.org                                                                       |
| 417BE9B2-1F8D-4D4F-917F-E8706EC593CF | AmplifyでGitHubログインしたい                                              | Amplify         | /Users/shotaroaoki/zettelkasten/20240205224309-amplifyでgithubログインしたい.org                                              |
| 417BE9B2-1F8D-4D4F-917F-E8706EC593CF | AmplifyでGitHubログインしたい                                              | AWS             | /Users/shotaroaoki/zettelkasten/20240205224309-amplifyでgithubログインしたい.org                                              |
| 1DD522D9-0FD1-4913-B27B-CCC5D9226216 | Exercism-elisp                                                             | emacs           | /Users/shotaroaoki/zettelkasten/20240504142506-exercism_elisp.org                                                             |
| DA4A3C1D-2AEC-498A-A957-8060C339AE15 | org-cycle                                                                  | org-mode        | /Users/shotaroaoki/zettelkasten/20240704222808-org_cycle.org                                                                  |
| 09C3E1C9-55DF-4CCB-972B-A3023FF570AB | window.fetch                                                               | web             | /Users/shotaroaoki/zettelkasten/20240422223408-window_fetch.org                                                               |
| 530416EF-093E-4803-8064-CD2969E030D3 | The Mars Volta                                                             | artist          | /Users/shotaroaoki/zettelkasten/20240830004903-the_mars_volta.org                                                             |
| 530416EF-093E-4803-8064-CD2969E030D3 | The Mars Volta                                                             | music           | /Users/shotaroaoki/zettelkasten/20240830004903-the_mars_volta.org                                                             |
| 837AE3A7-0B1F-4CF6-8B2F-06AF5BCFAF62 | AWS AmplifyとAmanzon Q Developerを活用した生成AIアプリケーションの作り方   | GenAI           | /Users/shotaroaoki/zettelkasten/20240621114931-aws_amplifyとamanzon_q_developerを活用した生成aiアプリケーションの作り方.org   |
| 837AE3A7-0B1F-4CF6-8B2F-06AF5BCFAF62 | AWS AmplifyとAmanzon Q Developerを活用した生成AIアプリケーションの作り方   | AWS_SUMMIT_2024 | /Users/shotaroaoki/zettelkasten/20240621114931-aws_amplifyとamanzon_q_developerを活用した生成aiアプリケーションの作り方.org   |
| 837AE3A7-0B1F-4CF6-8B2F-06AF5BCFAF62 | AWS AmplifyとAmanzon Q Developerを活用した生成AIアプリケーションの作り方   | AWS             | /Users/shotaroaoki/zettelkasten/20240621114931-aws_amplifyとamanzon_q_developerを活用した生成aiアプリケーションの作り方.org   |
| 0E99DB6C-4F1F-46DD-9FDB-EF28443A2E27 | Flutterの束縛されない制約                                                  | Flutter         | /Users/shotaroaoki/zettelkasten/20240218154645-flutterの束縛されない制約.org                                                  |
| 705AE576-F876-42E1-BAB0-E4135A7D76D6 | Fuse.js                                                                    | JavaScript      | /Users/shotaroaoki/zettelkasten/20240402234215-fuse_js.org                                                                    |
| 6A9DCFB7-41A4-4927-B061-D4F535C5E0C6 | ディメンション                                                             | LookerStudio    | /Users/shotaroaoki/zettelkasten/20240509134726-looker_studio.org                                                              |
| 88F3E78B-05D2-4C70-A4DD-FB17B7904945 | publish-org-roam-uiで画像のATTR_HTMLをサポート                             | org-mode        | /Users/shotaroaoki/zettelkasten/20240620221725-publish_org_roam_uiで画像のattr_htmlをサポート.org                             |
| 88F3E78B-05D2-4C70-A4DD-FB17B7904945 | publish-org-roam-uiで画像のATTR_HTMLをサポート                             | org-roam        | /Users/shotaroaoki/zettelkasten/20240620221725-publish_org_roam_uiで画像のattr_htmlをサポート.org                             |
| E7293D0C-B160-4B2B-8AE1-68C79CEDB383 | Content Security Policy(CSP)                                               | web             | /Users/shotaroaoki/zettelkasten/20240419191359-content_security_policy_csp.org                                                |
| 9D7068AD-090B-4C72-B1D3-AA97E34FF736 | org-roam-uiのgraphdata                                                     | org-roam        | /Users/shotaroaoki/zettelkasten/20240630005828-org_roam_uiのgraphdata.org                                                     |
| 41ABE4AF-B783-41F9-8988-1B805830C15C | emacsでモダンなWeb開発環境を整える                                         | emacs           | /Users/shotaroaoki/zettelkasten/20241121162454-emacsでモダンなweb開発環境を整える.org                                         |
| 41ABE4AF-B783-41F9-8988-1B805830C15C | emacsでモダンなWeb開発環境を整える                                         | web             | /Users/shotaroaoki/zettelkasten/20241121162454-emacsでモダンなweb開発環境を整える.org                                         |
| 41ABE4AF-B783-41F9-8988-1B805830C15C | emacsでモダンなWeb開発環境を整える                                         | TypeScript      | /Users/shotaroaoki/zettelkasten/20241121162454-emacsでモダンなweb開発環境を整える.org                                         |
| 60A8CB9A-C55B-4D69-8E83-5D8D7C26F2BE | org-attach                                                                 | org-mode        | /Users/shotaroaoki/zettelkasten/20240704220548-org_attach.org                                                                 |
| 5404432B-F244-412A-B57D-89DCBCFDE509 | org-attach-attach (a)                                                      | org-mode        | /Users/shotaroaoki/zettelkasten/20240704220548-org_attach.org                                                                 |
| F2871A66-B977-4335-9BE0-8CD68C7C0D03 | org-attach-method (c/m/l)                                                  | org-mode        | /Users/shotaroaoki/zettelkasten/20240704220548-org_attach.org                                                                 |
| B878A64B-8034-4464-BA26-6B117BAE284E | org-attach-new (n)                                                         | org-mode        | /Users/shotaroaoki/zettelkasten/20240704220548-org_attach.org                                                                 |
| 65BAFC71-B9E5-44BF-A2BD-D2EE1F1ACDC0 | org-attach-sync (z)                                                        | org-mode        | /Users/shotaroaoki/zettelkasten/20240704220548-org_attach.org                                                                 |
| 688E4E86-67C0-4E2A-AC4D-09E1AA59B195 | org-attach-open (o)                                                        | org-mode        | /Users/shotaroaoki/zettelkasten/20240704220548-org_attach.org                                                                 |
| AF82199C-F2A9-4C2D-BDC8-59D98BF620B2 | org-attach-open-in-emacs (O)                                               | org-mode        | /Users/shotaroaoki/zettelkasten/20240704220548-org_attach.org                                                                 |
| BE345A34-5235-4944-A907-9AF82C50B228 | org-attach-reveal (f)                                                      | org-mode        | /Users/shotaroaoki/zettelkasten/20240704220548-org_attach.org                                                                 |
| BD71524C-100E-457F-B98D-D0A35F50BD01 | org-attach-reveal-in-emacs (F)                                             | org-mode        | /Users/shotaroaoki/zettelkasten/20240704220548-org_attach.org                                                                 |
| C9ADAF9F-BDA3-4CCC-91AE-9D55B5A19F3F | org-attach-delete-one (d)                                                  | org-mode        | /Users/shotaroaoki/zettelkasten/20240704220548-org_attach.org                                                                 |
| 5683BAB4-3965-4EFD-8688-02A3FF92F8DF | org-attach-delete-all (D)                                                  | org-mode        | /Users/shotaroaoki/zettelkasten/20240704220548-org_attach.org                                                                 |
| 5F333242-8338-4B72-A1EF-775A975E8887 | org-attach-set-directory (s)                                               | org-mode        | /Users/shotaroaoki/zettelkasten/20240704220548-org_attach.org                                                                 |
| EBBDB60D-A9D3-480C-9DE6-CE2109621183 | test                                                                       | org-mode        | /Users/shotaroaoki/zettelkasten/20240704220548-org_attach.org                                                                 |
| EBBDB60D-A9D3-480C-9DE6-CE2109621183 | test                                                                       | ATTACH          | /Users/shotaroaoki/zettelkasten/20240704220548-org_attach.org                                                                 |
| 6A897622-658B-4446-A92D-BC4B3D24362C | FlutterのゴールデンテストをCI上で実行し、レポートを作成する                | Flutter         | /Users/shotaroaoki/zettelkasten/20240420154744-flutterのゴールデンテストをci上で実行し_レポートを作成する.org                 |
| 6EF3A082-F254-44FC-9C30-9FAC307DA256 | 大人のための国語ゼミ                                                       | book            | /Users/shotaroaoki/zettelkasten/20240615154028-大人のための国語ゼミ.org                                                       |
| 3C19CF8D-6364-4D76-B1AA-035AEA1E0BD1 | AmplifyのGoogleログインが失敗する                                          | Cognito         | /Users/shotaroaoki/zettelkasten/20240128151526-amplifyのgoogleログインが失敗する.org                                          |
| 3C19CF8D-6364-4D76-B1AA-035AEA1E0BD1 | AmplifyのGoogleログインが失敗する                                          | AWS             | /Users/shotaroaoki/zettelkasten/20240128151526-amplifyのgoogleログインが失敗する.org                                          |
| 5D582188-304B-4FA7-986A-550A70484936 | DartでParameterized Test                                                   | Test            | /Users/shotaroaoki/zettelkasten/20240428003617-dartでparameterized_test.org                                                   |
| 5D582188-304B-4FA7-986A-550A70484936 | DartでParameterized Test                                                   | Flutter         | /Users/shotaroaoki/zettelkasten/20240428003617-dartでparameterized_test.org                                                   |
| 5D582188-304B-4FA7-986A-550A70484936 | DartでParameterized Test                                                   | Dart            | /Users/shotaroaoki/zettelkasten/20240428003617-dartでparameterized_test.org                                                   |
| 55509DE5-D623-49FD-AAFA-D0F67CE49B82 | take notes!                                                                | book            | /Users/shotaroaoki/zettelkasten/20240323022727-take_notes.org                                                                 |
| 4B4C633B-0113-4426-92FB-5FAB89CDF35C | ウェブワーカー                                                             | web             | /Users/shotaroaoki/zettelkasten/20240420001357-ウェブワーカー.org                                                             |
| 94AE6A6B-3241-4ECD-BF93-5AF4C4C7AA0D | showlogs                                                                   | mywork          | /Users/shotaroaoki/zettelkasten/20240224214055-showlogs.org                                                                   |
| 94AE6A6B-3241-4ECD-BF93-5AF4C4C7AA0D | showlogs                                                                   | Flutter         | /Users/shotaroaoki/zettelkasten/20240224214055-showlogs.org                                                                   |
| 5DDF3B5D-0AE6-4229-8325-352C5C31463B | org-roamのタグについて                                                     | emacs           | /Users/shotaroaoki/zettelkasten/20240125004140-org_roamのタグについて.org                                                     |
| 5DDF3B5D-0AE6-4229-8325-352C5C31463B | org-roamのタグについて                                                     | org-roam        | /Users/shotaroaoki/zettelkasten/20240125004140-org_roamのタグについて.org                                                     |
| C8EAF86D-44E8-4E14-8CAD-119A83A1BC7E | ethereal pop                                                               | genre(music)    | /Users/shotaroaoki/zettelkasten/20240905010200-ethereal_pop.org                                                               |
| C8EAF86D-44E8-4E14-8CAD-119A83A1BC7E | ethereal pop                                                               | music           | /Users/shotaroaoki/zettelkasten/20240905010200-ethereal_pop.org                                                               |
| 2BD15337-02A4-49FD-BC84-E87A19806C6A | org-roamをgitでpullしたとき                                                | org-roam        | /Users/shotaroaoki/zettelkasten/20240716114054-org_roamをgitでpullしたとき.org                                                |
| 41F9050E-B1F3-47CE-AAF3-71CF96DED6FE | faye-websocket                                                             | web             | /Users/shotaroaoki/zettelkasten/20240424233358-faye_websocket.org                                                             |
| C28C4EAE-E86F-4788-B8FE-2A3F60CBE30B | org-modeとLiveCoding                                                       | tidalcycles     | /Users/shotaroaoki/zettelkasten/20240902004634-org_modeとlivecoding.org                                                       |
| C28C4EAE-E86F-4788-B8FE-2A3F60CBE30B | org-modeとLiveCoding                                                       | org-mode        | /Users/shotaroaoki/zettelkasten/20240902004634-org_modeとlivecoding.org                                                       |
| 1EA9FE03-4CAD-4E96-9241-EC6BB4FEE2F0 | magitがinstallできない                                                     | emacs           | /Users/shotaroaoki/zettelkasten/20240209150818-magitがinstallできない.org                                                     |
| E5BDB5F5-A65E-43A2-8F9C-6DAAF9DD0E51 | export default                                                             | JavaScript      | /Users/shotaroaoki/zettelkasten/20240430165448-export_default.org                                                             |
| 4ED39C6C-F151-4EA2-AF4E-B77718959ED3 | publish-org-roam-ui                                                        | mywork          | /Users/shotaroaoki/zettelkasten/20240125232338-publish_org_roam_ui.org                                                        |
| 42CFD6D6-7893-47C9-BD67-49BD00672542 | infer                                                                      | TypeScript      | /Users/shotaroaoki/zettelkasten/20241116164351-infer.org                                                                      |
| 45E0A4B0-018D-4A27-8A34-5097A74640C8 | Edge-to-edge                                                               | Android         | /Users/shotaroaoki/zettelkasten/20241217155558-edge_to_edge.org                                                               |
| 3697F219-5A1F-492F-A6D7-5BE562F36ABE | Incremental export                                                         | DynamoDB        | /Users/shotaroaoki/zettelkasten/20241218155925-incremental_export.org                                                         |
| 3697F219-5A1F-492F-A6D7-5BE562F36ABE | Incremental export                                                         | AWS             | /Users/shotaroaoki/zettelkasten/20241218155925-incremental_export.org                                                         |
| 7D26A485-19E3-4143-9B04-3382276F5248 | Debug Paint Size Extension                                                 | Flutter         | /Users/shotaroaoki/zettelkasten/20241219151210-debug_paint_size_extension.org                                                 |
| 1399DEC2-CC55-454F-9D97-C015CDF5CF80 | Flutter RenderBox was not laid out                                         | Flutter         | /Users/shotaroaoki/zettelkasten/20241219130016-flutter_renderbox_was_not_laid_out.org                                         |
| 5291AE01-6D24-44AF-B0AF-4E025E59560E | RenderBoxとは                                                              | Flutter         | /Users/shotaroaoki/zettelkasten/20241219130016-flutter_renderbox_was_not_laid_out.org                                         |
| 519E4EF1-7B3C-4C7C-8A09-15F15382BAFB | middy                                                                      | AWS             | /Users/shotaroaoki/zettelkasten/20241223140603-middy.org                                                                      |
| FF5F65FA-3A85-4931-9A45-78AE66A7C310 | dashboard                                                                  | wip             | /Users/shotaroaoki/zettelkasten/20241205232421-dashboard.org                                                                  |
| FF5F65FA-3A85-4931-9A45-78AE66A7C310 | dashboard                                                                  | emacs           | /Users/shotaroaoki/zettelkasten/20241205232421-dashboard.org                                                                  |

* 
